% Зад. 1. Ще казваме, че списък от цифри [a1 , a2, . . . , an ] пред-
% ставя числото, което записано в десетична бройна система из-
% глежда a1a2, . . . an. Например списъкът [1, 2, 3] представя чис-
% лото 123. Да се дефинира предикат p(X, Y, Z), който по дадени
% списъци от цифри X и Y намира в Z представяне на сбора на
% числата, представени със списъците X и Y .

% 1 2 3 4  = 1 * 10^(n-1) + 2* 10^(n-2) + 3* 10^(n-3) + 4* 10^(n-4)
getSumOfNumList([],_,Sum,Sum).
getSumOfNumList([H|T],K,Sum,Temp):- K1 is K-1, TempN is Temp + (H * (10^K1)) , getSumOfNumList(T,K1,Sum,TempN).
len([],0).
len([_|T],N):- len(T,M), N is M+1.
getNum(L,Elem):-len(L,N), getSumOfNumList(L,N,Elem,0).

p(X,Y,Z):- getNum(X,XEl), getNum(Y,YEl), Z is XEl + YEl.


% Зад. 2. Ще казваме, че списък е кодичен, ако първият му еле-
% мент е 0, последният - 1 и всички останали елементи са кодични
% списъци. Ще казваме, че списък от нули и единици е кодиране-
% то на даден кодичен списък, ако може да се получи като изтри-
% ем квадратните скоби в записа на кодичния списък. Например
% списъкът [0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1] е кодирането на кодичния
% списък [0, [0, [0, 1], [0, [0, 1], 1], 1], [0, 1], 1]. Да се дефинира преди-
% кат q(X, Y ), който по дадено кодиране X намира кодичния спи-
% сък Y , чието кодиране е X.

% Ако елемента не е лист просто закачам за новия списък.
% Ако елемента  е лист тогава викам функцията за Самия списък и закачам получения резултат за новия списък.
append([],B,B).
append([H|T],B,[H|R]):- append(T,B,R).
isList(L):-len(L,N), N>1.

coding([],Result,Result).
coding([H|T],Result,Temp):- isList(H), coding(H,HL,[]), append(Temp,HL,NewTemp), coding(T,Result,NewTemp). 
coding([H|T],Result,Temp):- not(isList(H)), append(Temp,[H],NewTemp), coding(T,Result,NewTemp).
isCodic([]).
isCodic([H|T]):-(H=:=0 ; H=:=1) , isCodic(T). 
q(X,Y):-coding(X,Y,[]), isCodic(Y).