% I.1 Редиците на Фарей, Fn , са редици от двойки естествени числа, които
% се дефинират рекурсивно за n ≥ 1 по следния начин:
% • F1 = [[0, 1], [1, 1]];
% • Fn+1 се получава от Fn , като между всеки два последователни члена
% [a, b] и [c, d] на Fn, за които b+d = n+1, се добавя двойката [a+c, n+1].
% Да се дефинира на пролог едноместен предикат farey(F), който при пре-
% удовлетворяване генерира в F всички редици на Фарей. 

addNewPair([H],_,[H]).
addNewPair([[A,B],[C,D]|T],N1,[[A,B],[APC,N1]|R]):- B+D =:= N1,APC is A+C , addNewPair([[C,D]|T],N1,R).
addNewPair([[A,B],[C,D]|T],N1,[[A,B]|R]):- B+D =\= N1, addNewPair([[C,D]|T],N1,R).

fareyGen(L):- fareyGen(L,_).
fareyGen([[0,0],[1,1]],1).
fareyGen(L1,N1):- fareyGen(L,N), N1 is N+1  addNewPair(L,N1,L1).
